package sibirbear.model;

/*
 * Перечисление возможных шагов сценария для пользователя.
 */

public enum Steps {

    STEP100, // Авторизация
    STEP101, // Отработка кнопок меню
    STEP102, //
    STEP104, //
    STEP105, //
    STEP110, // Список заявок
    STEP120, // Создание заявки. Выбор проекта
    STEP121, // Создание заявки. Название заявки
    STEP122, // Создание заявки. Описание заявки
    STEP123, // Создание заявки. Контактные данные
    STEP124, // Создание заявки. AnyDesk
    STEP125, // Создание заявки. Прикрепление доп.файлов
    STEP126, // Создание заявки. Проверка введенных данных
    STEP127, // Создание заявки. Отправка
    STEP997, // Отмена действия. Предупреждение
    STEP998, // Отмена действия
    STEP999  // Возврат в главное меню

}
