package sibirbear.model;

/*
 * Перечисление возможных шагов сценария для пользователя.
 */

public enum Steps {

    STEP100, // Авторизация
    STEP101, // Отработка кнопок меню
    STEP102, //
    STEP104, //
    STEP105, //
    STEP110, // Список заявок
    STEP120, // Создание заявки. Выбор проекта
    STEP121, // Создание заявки. Название заявки
    STEP122, // Создание заявки. Описание заявки
    STEP997, // Отмена действия. Предупреждение
    STEP998, // Отмена действия
    STEP999  // Возврат в главное меню

}
