package info.fermercentr.model;

/*
 * Перечисление возможных шагов сценария для пользователя.
 */

public enum Steps {

    STEP100, // Ввод логина
    STEP101, // Авторизация
    STEP102, // Отработка кнопок меню
    STEP103, //
    STEP104, //
    STEP105, //
    STEP110, // Список заявок
    STEP120, // Создание заявки. Выбор проекта
    STEP121, //Создание заявки. Выбор подразделения
    STEP122, // Создание заявки. Название заявки
    STEP123, // Создание заявки. Описание заявки
    STEP124, // Создание заявки. Контактные данные
    STEP125, // Создание заявки. AnyDesk
    STEP126, // Создание заявки. Прикрепление доп.файлов
    STEP127, // Создание заявки. Проверка введенных данных
    STEP128, // Создание заявки. Отправка
    STEP997, // Отмена действия. Предупреждение
    STEP998, // Отмена действия
    STEP999  // Возврат в главное меню

}
